package com.example.menuonweek;

public class MondayMenu {
    public static final String TITLE_TEXT_1 = "Манная каша";
    public static final String DESCRIPTION_TEXT_1 = "Ну как можно умудриться испортить манную кашу!? Проще рецепта, наверно, даже не придумаешь.";
    public static final String RECIPE_TEXT_1 = "Общее время готовки – 15 минут \n" +
            "Активное время готовки – 5 минут  \n" +
            "Калорийность на 100 гр – 119 ккал\n" +
            "\n" +
            "Ингредиенты: \n" +
            "Молоко – 1 стакан\n" +
            "Вода – 1 ст.л.\n" +
            "Крупа манная – 2 ст.л. (без горки)\n" +
            "Сахар – 1 ч.л.\n" +
            "Добавки (сахар, соль, сливочное масло, варенье, изюм и т.д.) – по вкусу и желанию\n" + "\n" +
            "Приготовление:\n" +
            "1. Берем кастрюльку и наливаем в нее воду.\n" +
            "Поворачиваем кастрюльку до тех пор, пока вода не покроет дно.\n" +
            "Зачем? А это такая маленькая хитрость, чтобы молоко в процессе варки не подгорело.\n" +
            " \n" +
            "2. Ставим кастрюльку на огонь, доливаем молоко, добавляем сахар и доводим до состояния «почти закипело».\n" +
            "Сахар очень важно добавить именно на этом этапе, чтобы состояние «почти» не превратилось в «ой, опять молоко убежало!»\n" +
            "\n" +
            "3. Пока молоко закипает, отмеряем нужное количество манки.\n" +
            "Это очень важно сделать заранее, потому что на следующем этапе нужно будет одной рукой всыпать в молоко манку, а второй рукой непрерывно помешивать молоко, чтобы не образовались комочки.\n" +
            "Конечно, если у вас есть третья рука, чтобы в это время держать емкость с манкой, то можно этот пункт пропустить.\n" +
            "\n" +
            "4. Тонкой струйкой всыпаем манку в молоко, непрерывно помешивая содержимое кастрюльки.\n" +
            "\n" +
            "5. Следующие пять минут продолжаем непрерывное помешивание.\n" +
            "Если перестать, то каша украсится симпатичными, но невкусными комочками.\n" +
            "\n" +
            "6. Закрываем крышкой, выключаем огонь и даем манной каше «допреть» еще 5 минут.\n" +
            "\n" +
            "7. За это время готовим нужную добавку: отрезаем масло, промываем изюм, открываем банку с вареньем и т.д.\n" +
            "\n" +
            "8. Добавляем в кашу нужную добавку и подаем на стол вкусную, ароматную, в меру сладкую и густую манную кашу.\n" +
            "\n" +
            "Приятного аппетита!";
    public static String TITLE_TEXT_2 = "Суп-гуляш";
    public static String DESCRIPTION_TEXT_2 = "В этом супе много мяса с большой буквы М. Оно там плавает не для бульона, ";
    public static String RECIPE_TEXT_2 = "Общее время готовки – 2 часа 45 минут\n" + "Активное время готовки – 30 минут\n" + "Калорийность на 100 гр – 55 ккал\n" + "Количество порций – 8 " +
            "\n" + "\n" +
            "Ингредиенты:\n" + "Говядина – 500-800 гр.Мясо можно брать не слишком хорошее – лопатку, грудинку, верхнюю часть рульки, мотолыгу (т.е. ссек, огузок, подбедёрок – нижние 2/3 от верхней части ноги)\n" +
            "Картофель – 5 шт.\n" +
            "Морковь – 1 шт.\n" +
            "Лук – 3 шт.\n" +
            "Перец болгарский – 1-2 шт.\n" +
            "Томатная паста – 1 ст.л. (можно использовать свежие помидоры)\n" +
            "Паприка сладкая – 3 ст.л. (молотая)\n" +
            "Лавровый лист – 3-5 шт.\n" +
            "Масло растительное – для обжарки\n" +
            "Зелень – для украшения\n" +
            "Ингредиенты расчитаны на 2-х литровую кастрюлю.\n" +
            "\n" +
            "Совет: Качественной охлаждённой говядине свойственен характерный «чистый» мясной запах.Консистенция свежего мяса плотная, волокна на его разрезах не липнут к рукам, а образующаяся от надавливания пальцем ямка быстро восстанавливается. Цвет охлаждённой говядины зависит от возраста животного – от беловато-розового у телятины до ярко-красного у мяса взрослого животного. Цвет мороженой говядины на поверхности и на разрезах красный с серым оттенком из-за мелких кристалликов льда. Определить, не замораживалась ли говядина дважды (что, как известно, сильно ухудшает её вкус) можно, приложив палец. След от пальца на качественном мясе станет ярко-красным, в то время как на дважды замороженном не изменится.\n" +
            "\n" +
            "Приготовление:\n" +
            "\n" +
            "1. Мелко порезать лук и обжарить его в масле до мягкости.2. Мясо порезать кубиками со стороной 2см.\n" +
            "\n" +
            "3. В лук положить паприку, перемешать и жарить не более полминуты. Положить мясо. Перемешать. Когда выделившийся из мяса сок закипит, огонь убавить до минимума, сковороду накрыть крышкой и тушить мясо в собственном соку от 1 до 2-х часов – до мягкости. Если жидкость будет слишком сильно испаряться, то при необходимости подливать кипяток так, чтобы мясо было скрыто в жидкости не полностью." +
            "Когда мясо будет практически готово, всыпать 1,5 ч ложки соли и молотый перец.\n" +
            "\n" +
            "4. Мясо из сковороды вместе с соком переложить в кастрюлю, влить 1л кипятка и поставить на большой огонь.5. Картофель почистить и крупно нарезать. Морковь порезать тонкими кружочками. Когда суп закипит, положить картофель и морковь. Вновь довести до кипения, огонь убавить и варить при лёгком кипении 15~20 минут до готовности картофеля." +
            "Овощи для гуляша\n" +
            "\n" +
            "6. Положить перец, нарезанный тонкими полосками, томатную пасту (или помидоры, очищенные от кожицы и порезанные маленькими кубиками), лавровый лист. При желании в суп-гуляш можно положить измельчённый зубчик чеснока." +
            "Варить 5~7 минут и можно подавать на стол.\n" +
            "\n" +
            "Приятного аппетита!";

    public static String TITLE_TEXT_3 = "Рататуй с рисом";
    public static String DESCRIPTION_TEXT_3 = "Традиционное овощное блюдо прованской кухни из перца, баклажанов и кабачков, во многом похожее на венгерское лечо.";
    public static String RECIPE_TEXT_3 = "Общее время готовки – 40 мин + 45 мин в духовк\n" + "Калорийность на 100 гр – 175 Ккал\n" + "\n" +
            "Ингредиенты:\n" + "Соль поваренная пищевая\n" + "Перец черный молотый\n" + "Чеснок - 1шт\n" + "Лук репчатый - 1шт\n" + "Помидоры - 2шт\n" + "Перец Болгарский красный - 2шт\n" + "Кабачок - 1шт\n" + "Баклажаны - 1шт\n" + "Сахар-песок - 20г\n" + "Вода - 500мл";
}
