package com.example.menuonweek;

public class MondayMenu {

    public static String TITLE_TEXT_3 = "Рататуй с рисом";
    public static String DESCRIPTION_TEXT_3 = "Традиционное овощное блюдо прованской кухни из перца, баклажанов и кабачков, во многом похожее на венгерское лечо.";
    public static String RECIPE_TEXT_3 = "Общее время готовки – 40 мин + 45 мин в духовк\n" + "Калорийность на 100 гр – 175 Ккал\n" + "\n" +
            "Ингредиенты:\n" + "Соль поваренная пищевая\n" + "Перец черный молотый\n" + "Чеснок - 1шт\n" + "Лук репчатый - 1шт\n" + "Помидоры - 2шт\n" + "Перец Болгарский красный - 2шт\n" + "Кабачок - 1шт\n" + "Баклажаны - 1шт\n" + "Сахар-песок - 20г\n" + "Вода - 500мл\n" + "Томатная паста - 50г\n" + "Рис белый - 230г\n" + "";
}
