package com.example.menuonweek;

public class Utils {
    public static final String TITLE_TEXT_1 = "Манная каша";
    public static final String DESCRIPTION_TEXT_1 = "Ну как можно умудриться испортить манную кашу!? Проще рецепта, наверно, даже не придумаешь.";
    public static final String RECIPE_TEXT_1 = "Общее время готовки – 15 минут \n" +
            "Активное время готовки – 5 минут  \n" +
            "Стоимость – 12 рублей\n" +
            "Калорийность на 100 гр – 119 ккал\n" +
            "Ингредиенты: \n" +
            "Молоко – 1 стакан\n" +
            "Вода – 1 ст.л.\n" +
            "Крупа манная – 2 ст.л. (без горки)\n" +
            "Сахар – 1 ч.л.\n" +
            "Добавки (сахар, соль, сливочное масло, варенье, изюм и т.д.) – по вкусу и желанию\n" +
            "Приготовление:\n" +
            "\n" +
            "1. Берем кастрюльку и наливаем в нее воду.\n" +
            "Поворачиваем кастрюльку до тех пор, пока вода не покроет дно.\n" +
            "Зачем? А это такая маленькая хитрость, чтобы молоко в процессе варки не подгорело.\n" +
            " \n" +
            "\n" +
            "2. Ставим кастрюльку на огонь, доливаем молоко, добавляем сахар и доводим до состояния «почти закипело».\n" +
            "Сахар очень важно добавить именно на этом этапе, чтобы состояние «почти» не превратилось в «ой, опять молоко убежало!»\n" +
            "3. Пока молоко закипает, отмеряем нужное количество манки.\n" +
            "Это очень важно сделать заранее, потому что на следующем этапе нужно будет одной рукой всыпать в молоко манку, а второй рукой непрерывно помешивать молоко, чтобы не образовались комочки.\n" +
            "Конечно, если у вас есть третья рука, чтобы в это время держать емкость с манкой, то можно этот пункт пропустить.\n" +
            "4. Тонкой струйкой всыпаем манку в молоко, непрерывно помешивая содержимое кастрюльки.\n" +
            "5. Следующие пять минут продолжаем непрерывное помешивание.\n" +
            "Если перестать, то каша украсится симпатичными, но невкусными комочками.\n" +
            "6. Закрываем крышкой, выключаем огонь и даем манной каше «допреть» еще 5 минут.\n" +
            "7. За это время готовим нужную добавку: отрезаем масло, промываем изюм, открываем банку с вареньем и т.д.\n" +
            "8. Добавляем в кашу нужную добавку и подаем на стол вкусную, ароматную, в меру сладкую и густую манную кашу.\n" +
            "Приятного аппетита!";

}
