package com.example.menuonweek.food;

import com.example.menuonweek.R;

public class GoulashSoup implements RecipeInterface {
    @Override
    public int getImageResource() {
        return R.drawable.sup_guljj;
    }

    @Override
    public String getTitle() {
        return "Суп-гуляш";
    }

    @Override
    public String getDescription() {
        return "В этом супе много мяса с большой буквы М. Оно там плавает не для бульона...";
    }

    @Override
    public String getRecipe() {
        return "Общее время готовки – 2 часа 45 минут\n" + "Активное время готовки – 30 минут\n" + "Калорийность на 100 гр – 55 ккал\n" +
                "Количество порций – 8 " + "\n" + "\n" +
                "Ингредиенты:\n" + "Говядина – 500-800 гр.Мясо можно брать не слишком хорошее – лопатку, грудинку, верхнюю часть рульки, мотолыгу (т.е. ссек, огузок, подбедёрок – нижние 2/3 от верхней части ноги)\n" + "Картофель – 5 шт.\n" +
                "Морковь – 1 шт.\n" + "Лук – 3 шт.\n" + "Перец болгарский – 1-2 шт.\n" + "Томатная паста – 1 ст.л. (можно использовать свежие помидоры)\n" +
                "Паприка сладкая – 3 ст.л. (молотая)\n" + "Лавровый лист – 3-5 шт.\n" + "Масло растительное – для обжарки\n" + "Зелень – для украшения\n" +
                "Ингредиенты расчитаны на 2-х литровую кастрюлю.\n" +
                "\n" + "Совет: Качественной охлаждённой говядине свойственен характерный «чистый» мясной запах.Консистенция свежего мяса плотная, волокна на его разрезах не липнут к рукам, а образующаяся от надавливания пальцем ямка быстро восстанавливается. Цвет охлаждённой говядины зависит от возраста животного – от беловато-розового у телятины до ярко-красного у мяса взрослого животного. Цвет мороженой говядины на поверхности и на разрезах красный с серым оттенком из-за мелких кристалликов льда. Определить, не замораживалась ли говядина дважды (что, как известно, сильно ухудшает её вкус) можно, приложив палец. След от пальца на качественном мясе станет ярко-красным, в то время как на дважды замороженном не изменится.\n" +
                "\n" + "Приготовление:\n" +
                "\n" + "1. Мелко порезать лук и обжарить его в масле до мягкости.2. Мясо порезать кубиками со стороной 2см.\n" +
                "\n" + "3. В лук положить паприку, перемешать и жарить не более полминуты. Положить мясо. Перемешать. Когда выделившийся из мяса сок закипит, огонь убавить до минимума, сковороду накрыть крышкой и тушить мясо в собственном соку от 1 до 2-х часов – до мягкости. Если жидкость будет слишком сильно испаряться, то при необходимости подливать кипяток так, чтобы мясо было скрыто в жидкости не полностью." +
                "Когда мясо будет практически готово, всыпать 1,5 ч ложки соли и молотый перец.\n" +
                "\n" + "4. Мясо из сковороды вместе с соком переложить в кастрюлю, влить 1л кипятка и поставить на большой огонь.5. Картофель почистить и крупно нарезать. Морковь порезать тонкими кружочками. Когда суп закипит, положить картофель и морковь. Вновь довести до кипения, огонь убавить и варить при лёгком кипении 15~20 минут до готовности картофеля." +
                "Овощи для гуляша\n" +
                "\n" + "6. Положить перец, нарезанный тонкими полосками, томатную пасту (или помидоры, очищенные от кожицы и порезанные маленькими кубиками), лавровый лист. При желании в суп-гуляш можно положить измельчённый зубчик чеснока." +
                "Варить 5~7 минут и можно подавать на стол.\n" + "\n" + "Приятного аппетита!";
    }
}
