package com.example.menuonweek.food;

import com.example.menuonweek.R;

public class PotatoZrazyWithMushrooms implements RecipeInterface {
    @Override
    public int getImageResource() {
        return R.drawable.kartofelnye_zrazy_s_gribami;
    }

    @Override
    public String getTitle() {
        return "Картофельные зразы с грибами\n + Салат с рукколой и редисом";
    }

    @Override
    public String getDescription() {
        return "Чудесное блюдо к ужину, за которое ваши домашние будут искренне вам благодарны";
    }

    @Override
    public String getRecipe() {
        return "Общее время готовки – 1 час 0 минута \n" + "Активное время готовки – 0 часов 40 минут \n" + "Калорийность на 100 гр — 93 ккал\n" + "Количество порций – 6 порций\n" +
                "\n" + "Ингредиенты:\n" + "Картофель – 1 кг (примерно)\n" + "Грибы – 300 г (шампиньоны или вешенки)\n" + "Лук репчатый – 1 шт.\n" + "Яйцо – 1 шт. (или 2 маленьких)\n" +
                "Мука – 4 ст.л.\n" + "Масло подсолнечное – 4 ст.л. для жарки\n" + "Сухари панировочные – 4 ст.л. для жарки\n" + "Соль – по вкусу\n" + "Перец черный – по вкусу (молотый)\n" + "Орех мускатный – по вкусу\n" +
                "\nПриготовление:\n" +
                "\n1.Основой для зраз является отварной картофель. Тут возможны два варианта приготовления картофеля: отварить картофель «в мундире», очистить от кожуры, протереть через сито; либо сварить очищенный картофель и истолочь в пюре. Я выбираю второй вариант – так традиционно готовят женщины в моей семье. Картошку очищаю и отправляю варить. В процессе варки можно подсолить. Картошка сварится и без моего дальнейшего участия, а я тем временем подготовлю начинку.\n" +
                "Для начинки я использую обжаренные с луком грибы. Грибы, в принципе, подойдут любые. Проще и быстрее будет иметь дело с грибочками, предлагаемыми магазинами: шампиньонами или вешенками — они не требуют дополнительной тепловой обработки, достаточно обжарить.\n" +
                "Лук и шампиньоны нарезаю произвольно, потом измельчу при помощи блендера." + "\n" +
                "\n2. Слегка обжариваю грибы, затем добавляю лук. Подсаливаю, добавляю чёрный молотый перчик. Если не имеете ничего против мускатного ореха – добавьте молотого щепотку – ваше блюдо приобретёт приятный пикантный вкус и аромат. Готовые продукты снимаю с огня и оставляю остывать." + "\n" +
                "\n3.Тем временем готова и картошка. Сливаю воду и растираю в пюре без добавления масла, воды, молока – только картошка.\n" +
                "\n4.В картофельное пюре вбиваю яйцо, добавляю муку, вымешиваю некрутое тесто.\n" +
                "\n5.Формируют зразы как пирожки: кладём начинку, защипываем, немного прессуем. Картофельное тесто – не самое «послушное». Потому призываю в помощь панировочные сухари, с ними формировать проще, руки чище, зразы гарантированно не прилипают к сковороде, а в готовом виде изделия приобретают аппетитный золотистый оттенок, в общем, сплошные плюсы.\n" + "\n" +
                "\n6.Обжариваю в раскалённом растительном масле до золотистой корочки.\n" +
                "\n7.И картофельные зразы с грибами готовы. Попробуйте их со сметаной, хреном или горчичным соусом.\n" +
                "\n" + "\nКак готовить салат из рукколы и редиса\n" +
                "\nОбщее и активное время готовки – 10 минут\n" +
                "Калорийность на 100 гр – 76 ккал\n" + "\nИнгрeдиенты:\n" +
                "Руккола – 1 пучок (большой)\n" +
                "Помидоры черри – 1 стакан\n" +
                "Редис – 10 штук\n" +
                "Орехи кедровые – 1-2 ст.л.\n" +
                "Сок лимонный – 2 ч.л.\n" +
                "Масло оливковое – 1 ст.л.\n" +
                "Соль – по вкусу\n" +
                "Перец черный – по вкусу\n" +
                "\nПриготовление:\n" +
                "Редис нарезать тонкими ломтиками, помидоры черри разрезать пополам. Рукколу помыть и разрезать на части. Заправить салат оливковым маслом и соком лимона. Посыпать сверху поджаренным кедровыми орешками. Посолить и поперчить по вкусу.\n" +
                "\n" + "Приятного аппетита!";
    }
}
